using System.Collections.Generic;
using System.Linq;
using Data.Models;

namespace Data.Departments
{
    public class FDMDT
    {
        public static List<Employee> FDMDTEmp()
        {
            //todo add name and concat
            string[] fullName =
            {
                "Свилен Петков Станев",
                "Пламена Неделчева Тодорова",
                "Силвия Миленова Янева",
                "Хафизе Реджеб Кадриева",
                "Гергина Василева Цолова",
                "Петя Цонева Петрова"
            };
            Employee emp = new Employee();
            emp.Department = "АСД, деловодство и архив";
            emp.professionalLeve = "Старши експерт";
            emp.FirstName = fullName[0].Split().ToArray()[0];
            emp.MiddleName = fullName[0].Split().ToArray()[1];
            emp.LastName = fullName[0].Split().ToArray()[2];
            emp.roomNumber = "1011";
            emp.email = "";
            emp.phoneNumber = "618/278";

            //var infoData = new List<string>
            //{
            //     "Директор	 Полина Тодорова Иванова	407	p.ivanova@razgrad.bg	618/144",
            //    "Началник отдел	 Кремена Красимирова Приставова	9	mdt@razgrad.bg	618/120 k.pristavova@razgrad.bg",
            //    "Главен експерт	Мариана Маринова Дочева	10	m.docheva@razgrad.bg	618/130",
            //    "Счетоводител оперативен	Елка Маринова Господинова	10		618/130",
            //    "Главен инспектор	Росен Йорданов Стоянов	111		618/112",
            //    "Инспектор	Павлинка Игнатова Петкова	фронт офис 2		618/301",
            //    "Специалист	Севинч Ергинова Исмаилова	фронт офис 2		618/301",
            //    "Данъчен инспектор	Павлина Стоянова Добрева	фронт офис 2	mdt_office@razgrad.bg 	618/301",
            //    "Инспектор	Йордан Йорданов Цанев	112		618/254",
            //    "Специалист	Цветомира Любомирова Иванова 	фронт офис 3		618/111",
            //    "Данъчен инспектор	Стоян Валентинов Стоянов	фронт офис 2		618/301",
            //    "Старши специалист	 Мария Тодорова Иванова	фронт офис 3		618/110",
            //    "Юрисконсулт	Емине Алкин Хюсеинова	302		618/315 замества се от Мариета Станимирова Борисова",
            //    "Старши специалист	Бахтишен Сали Тефик 	фронт офис 2		618/301",
            //    "Юрисконсулт	Димитър Василев Генов 	302	d.genov@razgrad.bg 	618/315",
            //    "Инспектор	Станислава Петрова Дачева	фронт офис 2		618/301",
            //    "Инспектор	 Неделина Йорданова Йорданова	112		618/254",
            //    "Инспектор	Николай Цонев Николов	112		618/254",
            //    "Ст. счетоводител	Павлина Тодорова Вангелова	403	p.vangelova@razgrad.bg	618/229",
            //    "Ст. счетоводител	Велина Великова Дачева	403	finansi@razgrad.bg	618/228",
            //    "Ст. счетоводител	Недялка Георгиева Янкова	404	n.yankova@razgrad.bg	618/221",
            //    "Ст. счетоводител	Галина Стоянова Йорданова	404	finansi@razgrad.bg	618/221 замества се отГабриела Миленова Петрова",
            //    "Ст. счетоводител	Габриела Красимирова Иванова-Илиева	404	finansi@razgrad.bg	618/225",
            //    "Счетоводител-оперативен	Нели Иванова Станчева	404	finansi@razgrad.bg	618/225",
            //    "Счетоводител	Анка Михайлова Иванова	411	a.ivanova@razgrad.bg	618/233",
            //    "Касиер-счетоводство	Галина Недялкова Димитрова	Фронт офис 1	g.dimitrova@razgrad.bg	618/302",
            //    "Главен експерт	Даниела Йорданова Николова	406	budget@razgrad.bg	618/137",
            //    "Главен експерт	Мартина Румянова Цолова	401	trz@razgrad.bg	618/231",
            //    "Главен експерт	Севдалина Иванова Карачанова	401	s.karachanova@razgrad.bg	618/235",
            //    "Главен експерт Човешки ресурси	Милена Найденова Рашкова 	402A	m.rashkova@razgrad.bg	618/285",
            //    "Главен специалист 	Галина Трифонова Неделчева	402	galina.nedelcheva@razgrad.bg	618/286",
            //    "Главен експерт Човешки ресурси	Галина Тодорова Великова 	402	g.velikova@razgrad.bg  	618/286"
            //};

            List<Employee> empCollection = new List<Employee>
            {
                emp
            };

            return empCollection;
        }
    }
}