using System.Collections.Generic;

namespace Data
{
    public class Helper
    {






    }
    //private List<string> Oth()
    //{
    //var infoData = new List<string>
    //    {
    //        "Мл.експерт „Етнически и интеграционни въпроси	 Емануил Александров Николов	602	eiv@razgrad.bg	618/180",
    //        "Функция Отбрана и сигурност			",
    //        "Главен експерт ОМП и сигурност на информацията		305	omp@razgrad.bg	618/252",
    //        "Младши експерт ОМП		305	omp@razgrad.bg	618/252",
    //        "Старши специалист	Данчо Владимиров Димитров	305		618/252",
    //        "Организация, контрол и изпълнение дейностите по поддържане чистотата в обществените територии				",
    //        "Ръководител звено	Николай Добромиров Николаев	114a	  	618/271",
    //        "Младши експерт	Рефие Гюрсел Хюсню	114a	r.hyusnyu@razgrad.bg	618/271",
    //        "Хижа м. „Пчелина”				",
    //        "Управител	 Ваня Стефанова Коцева			662/736",
    //        "Специалист поддръжка	 Матьо Иванов Коцев			662/736",
    //        "Дежурни				",
    //        "Денонощна охрана		1		618/132",
    //        "Пропуск		4		618/151",
    //        "Кафе „Панорама” Сграда на Общинска администрация, 11 ет. 618/287"
    //    };

    //    return infoData;
    //}
}