using System.Collections.Generic;
using System.Linq;
using Data.Models;

namespace Data.Departments
{
    public class TSU
    {
        public static List<Employee> TSUEmp()
        {
            //todo add info and concat
            string[] fullName =
            {
                "Христо Стоянов Христов",
                "Ангел Георгиев Ангелов",
                "Атанаска Спирова Стойчева",
                "Павел Петров Павлов 211",
                "Пламена Йорданова Анферос",
                "Тодорка Симеонова Димитрова",
                "Кремена Росенова Неделчева",
                "Диана Стоянова Петкова",
                "Галя Василева Маринова",
                "Теодор Иванов Тодоров",
                "Станимир Тодоров Стоянов",
                "Иваничка Темелкова Иванова",
                "Милен Асенов Миланов",
                "Сашка Крумова Възелова",
                "Пенка Тодорова Спиридонова",
                "Мелис Бейхатова Ибрахимова",
                "Димитър Стоянов Христов",
                "Светлан Иванов Стоянов",
                "Иван Тодоров Ненов",
                "Ирина Иванова Илиева",
                "Магдалена Михайлова Петрова",
                "Михаил Стефанов Балтаджиев",
                "Пенка Димитрова Парашкевова",
                "Стамена Стоянова Иванова",
                "Сунай Юкселов Мехмедов",
                "Мирослава Георгиева Дзанева",
                "Кремена Стоянова Йорданова",
                "Валери Ангелов Вълчев"

            };
            Employee emp = new Employee();
            emp.Department = "Дирекция \"ТСУ, общинска собственост и контрол в строителството\"";
            emp.professionalLeve = "Старши експерт";
            emp.FirstName = fullName[0].Split().ToArray()[0];
            emp.MiddleName = fullName[0].Split().ToArray()[1];
            emp.LastName = fullName[0].Split().ToArray()[2];
            emp.roomNumber = "1011";
            emp.email = "";
            emp.phoneNumber = "618/278";

            //"Директор на дирекция	Христо Стоянов Христов	201	hhristov@razgrad.bg	618/177",
            //   "Старши специалист",
            //   "Старши юрисконсулт		205		618/187",
            //   "Отдел Териториално и селищно устройство, кадастър и търговия				",
            //   "Началник отдел		201		618/177",
            //   "Главен експерт	Ангел Георгиев Ангелов	211		618/211",
            //   "Главен специалист	Атанаска Спирова Стойчева	202	ato@razgrad.bg	618/181",
            //   "Старши специалист	Павел Петров Павлов	211		618/211",
            //   "Главен специалист	Пламена Йорданова Анферос	212	ato@razgrad.bg	618/212",
            //   "Главен специалист	Тодорка Симеонова Димитрова	205а	tsu@razgrad.bg	618/188",
            //   "Главен специалист	Кремена Росенова Неделчева	211	k.nedelcheva@razgrad.bg	618/211",
            //   "Старши специалист		209	  tsu@razgrad.bg	618/142",
            //   "Търговия				",
            //   "Главен експерт	Диана Стоянова Петкова	116	turgovia@razgrad.bg	618/222",
            //   "Главен експерт		116а	turgovia@razgrad.bg	618/224",
            //   "Старши експерт	Галя Василева Маринова	116а	turgovia@razgrad.bg	618/224",
            //   "Отдел Контрол по строителството ОРО и транспорт				",
            //   "Началник отдел		107	oro@razgrad.bg	618/155",
            //   "Главен инспектор	 Теодор Иванов Тодоров	114	ks@razgrad.bg	618/152",
            //   "Транспорт				",
            //   "Главен експерт Транспорт	Станимир Тодоров Стоянов	601	transport@razgrad.bg	618/257",
            //   "Главен специалист	Иваничка Темелкова Иванова	210a	tsu@razgrad.bg	618/244",
            //   "Главен експерт	Милен Асенов Миланов	210a	tsu@razgrad.bg	618/244",
            //   "Специалист	Сашка Крумова Възелова	105		618/251",
            //   "Контрол по обществен ред и транспорт				",
            //   "Старши инспектор ОРО	Пенка Тодорова Спиридонова	114		618/152",
            //   "Инспектор ОРО	Мелис Бейхатова Ибрахимова	115		618/258",
            //   "Инспектор ОРО	Димитър Стоянов Христов	115		618/258",
            //   "Инспектор ОРО	Светлан Иванов Стоянов	115		618/258",
            //   "Отдел Общинска собственост и земеделие				",
            //   "Н-к отдел	Иван Тодоров Ненов	412	ob_sobstvenost@razgrad.bg	618/143",
            //   "Главен експерт Общинска собственост	Ирина Иванова Илиева	413	i.ilieva@razgrad.bg,ob_sobstvenost@razgrad.bg	618/234",
            //   "Главен експерт Общинска собственост	Магдалена Михайлова Петрова	413	ob_sobstvenost@razgrad.bg	618/234",
            //   "Земеделие и стопанска дейност				",
            //   "Главен експерт Земеделие и стопанска дейност	Михаил Стефанов Балтаджиев	105	zemedelie@razgrad.bg	618/253",
            //   "Старши експерт	Пенка Димитрова Парашкевова	105	zemedelie@razgrad.bg	618/251",
            //   "Юрисконсулт	Стамена Стоянова Иванова	 413	urist.zemedelie@razgrad.bg	618/234",
            //   "Специалист поддръжка	Сунай Юкселов Мехмедов			618/277",
            //   "Главен експерт	Мирослава Георгиева Дзанева	гр.Разград, бул.България 21		661/366",
            //   "Старши специалист	Кремена Стоянова Йорданова	гр.Разград, бул.България 21		661/366",
            //   "Главен специалист - поддръжка	Валери Ангелов Вълчев	гр.Разград, бул.България 21		661/366",

            List<Employee> empCollection = new List<Employee>
            {
                emp
            };

            return empCollection;
        }
    }
}